Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.general.shortcuts.configuration.description
source: Click a shortcut to record it. Disabled shortcuts keep their saved key and still participate in conflict checks.
ar: انقر على اختصار لتسجيله. الاختصارات المعطلة تحتفظ بمفتاحها المحفوظ وتظل مشاركة في فحوصات التعارض.
de: Klicken Sie auf eine Tastenkombination, um sie aufzuzeichnen. Deaktivierte Tastenkombinationen behalten ihre gespeicherte Taste und nehmen weiterhin an Konfliktprüfungen teil.
es: Haz clic en un atajo para grabarlo. Los atajos desactivados conservan su tecla guardada y siguen participando en las comprobaciones de conflictos.
fr: Cliquez sur un raccourci pour l'enregistrer. Les raccourcis désactivés conservent leur touche enregistrée et participent toujours aux vérifications de conflits.
id: Klik pintasan untuk merekamnya. Pintasan yang dinonaktifkan tetap menyimpan tombol yang disimpan dan tetap berpartisipasi dalam pemeriksaan konflik.
it: Fai clic su una scorciatoia per registrarla. Le scorciatoie disabilitate mantengono il tasto salvato e partecipano comunque ai controlli di conflitto.
ja: ショートカットをクリックして記録します。無効にしたショートカットは保存されたキーを保持し、競合チェックの対象となります。
ko: 단축키를 클릭하여 기록하세요. 비활성화된 단축키는 저장된 키를 유지하며 충돌 검사에 계속 참여합니다.
nl: Klik op een sneltoets om deze op te nemen. Uitgeschakelde sneltoetsen behouden hun opgeslagen toets en doen nog steeds mee aan conflictencontroles.
pl: Kliknij skrót, aby go nagrać. Wyłączone skróty zachowują zapisany klawisz i nadal uczestniczą w sprawdzaniu konfliktów.
pt_br: Clique em um atalho para gravá‑lo. Atalhos desativados mantêm a tecla salva e ainda participam da verificação de conflitos.
ru: Нажмите сочетание клавиш, чтобы записать его. Отключённые сочетания сохраняют назначенную клавишу и по-прежнему участвуют в проверке конфликтов.
tr: Bir kısayola tıklayarak kaydedin. Devre dışı bırakılan kısayollar kaydedilmiş tuşlarını korur ve çakışma kontrollerine katılmaya devam eder.
uk: Натисніть комбінацію, щоб записати її. Вимкнені комбінації зберігають призначену клавішу та беруть участь у перевірці конфліктів.
vi: Nhấp vào một phím tắt để ghi lại. Các phím tắt bị vô hiệu hóa vẫn giữ phím đã lưu và vẫn tham gia kiểm tra xung đột.
zh_hans: 点击快捷键即可录制；关闭后仍会保留键位并参与冲突检查。
zh_hant: 點擊快捷鍵即可錄製。停用的快捷鍵仍會保留按鍵設定，並參與衝突檢查。

# settings.general.shortcuts.enabled.description
source: Disables keyboard triggers only. Menus, buttons, and AI message sending remain available.
ar: يعطل مشغلات لوحة المفاتيح فقط. تظل القوائم والأزرار وإرسال رسائل الذكاء الاصطناعي متاحة.
de: Deaktiviert nur Tastaturauslöser. Menüs, Schaltflächen und das Senden von KI-Nachrichten bleiben verfügbar.
es: Desactiva solo los disparadores de teclado. Los menús, botones y el envío de mensajes de IA siguen disponibles.
fr: Désactive uniquement les déclencheurs clavier. Les menus, boutons et l'envoi de messages IA restent disponibles.
id: Hanya menonaktifkan pemicu keyboard. Menu, tombol, dan pengiriman pesan AI tetap tersedia.
it: Disabilita solo i trigger da tastiera. Menu, pulsanti e invio messaggi AI rimangono disponibili.
ja: キーボードトリガーのみを無効にします。メニュー、ボタン、AIメッセージ送信は引き続き使用できます。
ko: 키보드 트리거만 비활성화합니다. 메뉴, 버튼 및 AI 메시지 전송은 계속 사용할 수 있습니다.
nl: Schakelt alleen toetsenbordtriggers uit. Menu's, knoppen en het verzenden van AI-berichten blijven beschikbaar.
pl: Wyłącza tylko wyzwalacze klawiaturowe. Menu, przyciski i wysyłanie wiadomości AI pozostają dostępne.
pt_br: Desativa apenas os acionadores de teclado. Menus, botões e envio de mensagens por IA permanecem disponíveis.
ru: Отключает только клавиатурные триггеры. Меню, кнопки и отправка сообщений ИИ остаются доступными.
tr: Yalnızca klavye tetikleyicilerini devre dışı bırakır. Menüler, düğmeler ve AI mesaj gönderme işlemleri kullanılabilir durumda kalır.
uk: Вимикає лише клавіатурні тригери. Меню, кнопки та надсилання повідомлень ШІ залишаються доступними.
vi: Chỉ vô hiệu hóa kích hoạt bàn phím. Menu, nút và gửi tin nhắn AI vẫn khả dụng.
zh_hans: 仅停用键盘触发；菜单、按钮和 AI 消息发送不受影响。
zh_hant: 僅停用鍵盤觸發。選單、按鈕和 AI 訊息發送仍可使用。

# settings.general.shortcuts.enabled.title
source: Enable Application Shortcuts
ar: تفعيل اختصارات التطبيق
de: Anwendungstastenkombinationen aktivieren
es: Activar atajos de aplicación
fr: Activer les raccourcis applicatifs
id: Aktifkan Pintasan Aplikasi
it: Abilita scorciatoie applicazione
ja: アプリケーションショートカットを有効にする
ko: 애플리케이션 단축키 활성화
nl: Sneltoetsen voor applicaties inschakelen
pl: Włącz skróty aplikacji
pt_br: Ativar Atalhos do Aplicativo
ru: Включить сочетания клавиш приложения
tr: Uygulama Kısayollarını Etkinleştir
uk: Увімкнути комбінації клавіш програми
vi: Bật Phím tắt Ứng dụng
zh_hans: 启用应用快捷键
zh_hant: 啟用應用程式快捷鍵

# settings.general.shortcuts.error.duplicateConfiguredAction
source: This shortcut is already assigned to another action.
ar: هذا الاختصار مُعين بالفعل لإجراء آخر.
de: Diese Tastenkombination ist bereits einer anderen Aktion zugewiesen.
es: Este atajo ya está asignado a otra acción.
fr: Ce raccourci est déjà attribué à une autre action.
id: Pintasan ini sudah ditetapkan ke tindakan lain.
it: Questa scorciatoia è già assegnata a un'altra azione.
ja: このショートカットはすでに別のアクションに割り当てられています。
ko: 이 단축키는 이미 다른 동작에 할당되어 있습니다.
nl: Deze sneltoets is al toegewezen aan een andere actie.
pl: Ten skrót jest już przypisany do innej akcji.
pt_br: Este atalho já está atribuído a outra ação.
ru: Это сочетание уже назначено другому действию.
tr: Bu kısayol zaten başka bir eyleme atanmış.
uk: Ця комбінація вже призначена іншій дії.
vi: Phím tắt này đã được gán cho một hành động khác.
zh_hans: 该快捷键已分配给另一项操作。
zh_hant: 此快捷鍵已分配給其他動作。

# settings.general.shortcuts.error.invalidKey
source: Use a single letter or number.
ar: استخدم حرفًا واحدًا أو رقمًا واحدًا.
de: Verwenden Sie einen einzelnen Buchstaben oder eine Zahl.
es: Usa una sola letra o número.
fr: Utilisez une seule lettre ou un seul chiffre.
id: Gunakan satu huruf atau angka.
it: Usa una singola lettera o numero.
ja: 1文字または数字を使用してください。
ko: 단일 문자나 숫자를 사용하세요.
nl: Gebruik een enkele letter of cijfer.
pl: Użyj pojedynczej litery lub cyfry.
pt_br: Use uma única letra ou número.
ru: Используйте одну букву или цифру.
tr: Tek bir harf veya rakam kullanın.
uk: Використовуйте одну літеру або цифру.
vi: Sử dụng một chữ cái hoặc số duy nhất.
zh_hans: 请使用单个英文字母或数字。
zh_hant: 請使用單一字母或數字。

# settings.general.shortcuts.error.missingModifier
source: Add Command, Option, or Control to avoid interfering with text input.
ar: أضف Command أو Option أو Control لتجنب التداخل مع إدخال النص.
de: Fügen Sie Befehl, Option oder Steuerung hinzu, um Störungen der Texteingabe zu vermeiden.
es: Añade Comando, Opción o Control para evitar interferir con la entrada de texto.
fr: Ajoutez Commande, Option ou Contrôle pour éviter d'interférer avec la saisie de texte.
id: Tambahkan Command, Option, atau Control untuk menghindari gangguan pada input teks.
it: Aggiungi Comando, Opzione o Control per evitare interferenze con l'inserimento di testo.
ja: テキスト入力の妨げにならないよう、Command、Option、またはControlを追加してください。
ko: 텍스트 입력 간섭을 방지하려면 Command, Option 또는 Control을 추가하세요.
nl: Voeg Command, Option of Control toe om interferentie met tekstinvoer te voorkomen.
pl: Dodaj Command, Option lub Control, aby uniknąć zakłócania wprowadzania tekstu.
pt_br: Adicione Command, Option ou Control para evitar interferência com a digitação de texto.
ru: Добавьте Command, Option или Control, чтобы не мешать вводу текста.
tr: Metin girişine müdahale etmemek için Command, Option veya Control ekleyin.
uk: Додайте Command, Option або Control, щоб уникнути перешкод під час введення тексту.
vi: Thêm Command, Option hoặc Control để tránh can thiệp vào nhập văn bản.
zh_hans: 请至少搭配 Command、Option 或 Control，避免影响正常输入。
zh_hant: 請加上 Command、Option 或 Control，以免干擾文字輸入。

# settings.general.shortcuts.error.reserved
source: This shortcut is already used by Starcat. Choose another combination.
ar: هذا الاختصار مُستخدم بالفعل من قبل Starcat. اختر تركيبة أخرى.
de: Diese Tastenkombination wird bereits von Starcat verwendet. Wählen Sie eine andere Kombination.
es: Este atajo ya lo usa Starcat. Elige otra combinación.
fr: Ce raccourci est déjà utilisé par Starcat. Choisissez une autre combinaison.
id: Pintasan ini sudah digunakan oleh Starcat. Pilih kombinasi lain.
it: Questa scorciatoia è già utilizzata da Starcat. Scegli un'altra combinazione.
ja: このショートカットはすでにStarcatで使用されています。別の組み合わせを選択してください。
ko: 이 단축키는 이미 Starcat에서 사용 중입니다. 다른 조합을 선택하세요.
nl: Deze sneltoets wordt al gebruikt door Starcat. Kies een andere combinatie.
pl: Ten skrót jest już używany przez Starcat. Wybierz inną kombinację.
pt_br: Este atalho já é usado pelo Starcat. Escolha outra combinação.
ru: Это сочетание уже используется Starcat. Выберите другую комбинацию.
tr: Bu kısayol Starcat tarafından zaten kullanılıyor. Başka bir kombinasyon seçin.
uk: Ця комбінація вже використовується Starcat. Виберіть іншу.
vi: Phím tắt này đã được Starcat sử dụng. Chọn tổ hợp khác.
zh_hans: 该快捷键已被 Starcat 使用，请选择其他组合。
zh_hant: 此快捷鍵已被 Starcat 使用，請選擇其他組合。

# settings.general.shortcuts.itemEnabled.help
source: Enable or disable this keyboard shortcut
ar: تفعيل أو تعطيل اختصار لوحة المفاتيح هذا
de: Diese Tastenkombination aktivieren oder deaktivieren
es: Activar o desactivar este atajo de teclado
fr: Activer ou désactiver ce raccourci clavier
id: Aktifkan atau nonaktifkan pintasan keyboard ini
it: Abilita o disabilita questa scorciatoia da tastiera
ja: このキーボードショートカットを有効または無効にします
ko: 이 키보드 단축키를 활성화 또는 비활성화합니다
nl: Schakel deze sneltoets in of uit
pl: Włącz lub wyłącz ten skrót klawiaturowy
pt_br: Ativar ou desativar este atalho de teclado
ru: Включить или отключить это сочетание клавиш
tr: Bu klavye kısayolunu etkinleştirir veya devre dışı bırakır
uk: Увімкнути або вимкнути цю комбінацію клавіш
vi: Bật hoặc tắt phím tắt bàn phím này
zh_hans: 启用或停用此键盘快捷键
zh_hant: 啟用或停用此鍵盤快捷鍵

# settings.general.shortcuts.knowledgeRAG.help
source: Click to record a new Knowledge RAG workspace shortcut
ar: انقر لتسجيل اختصار جديد لمساحة عمل Knowledge RAG
de: Klicken Sie, um eine neue Tastenkombination für den Knowledge-RAG-Arbeitsbereich aufzuzeichnen
es: Haz clic para grabar un nuevo atajo de espacio de trabajo de Knowledge RAG
fr: Cliquez pour enregistrer un nouveau raccourci d'espace de travail RAG de connaissances
id: Klik untuk merekam pintasan ruang kerja Knowledge RAG baru
it: Fai clic per registrare una nuova scorciatoia per l'area di lavoro Knowledge RAG
ja: クリックして新しいKnowledge RAGワークスペースのショートカットを記録
ko: 클릭하여 새로운 Knowledge RAG 작업공간 단축키를 기록합니다
nl: Klik om een nieuwe sneltoets voor de Knowledge RAG-werkruimte op te nemen
pl: Kliknij, aby nagrać nowy skrót do przestrzeni roboczej Knowledge RAG
pt_br: Clique para gravar um novo atalho do espaço de trabalho Knowledge RAG
ru: Нажмите, чтобы записать новое сочетание для рабочей области Knowledge RAG
tr: Yeni bir Knowledge RAG çalışma alanı kısayolu kaydetmek için tıklayın
uk: Натисніть, щоб записати нову комбінацію для робочого простору Knowledge RAG
vi: Nhấp để ghi lại phím tắt Knowledge RAG Workspace mới
zh_hans: 点击录制新的知识库 RAG 工作台快捷键
zh_hant: 點擊以錄製新的知識庫 RAG 工作區快捷鍵

# settings.general.shortcuts.knowledgeRAG.title
source: Knowledge RAG Workspace
ar: مساحة عمل Knowledge RAG
de: Knowledge-RAG-Arbeitsbereich
es: Espacio de trabajo de Knowledge RAG
fr: Espace de travail RAG de connaissances
id: Ruang Kerja Knowledge RAG
it: Area di lavoro Knowledge RAG
ja: Knowledge RAGワークスペース
ko: Knowledge RAG 작업공간
nl: Knowledge RAG-werkruimte
pl: Przestrzeń robocza Knowledge RAG
pt_br: Espaço de Trabalho Knowledge RAG
ru: Рабочая область Knowledge RAG
tr: Knowledge RAG Çalışma Alanı
uk: Робочий простір Knowledge RAG
zh_hans: 知识库 RAG 工作台
zh_hant: 知識庫 RAG 工作區

# settings.general.shortcuts.recording
source: Record
ar: تسجيل
de: Aufzeichnen
es: Grabar
fr: Enregistrer
id: Rekam
it: Registra
ja: 記録
ko: 기록
nl: Opnemen
pl: Nagraj
pt_br: Gravar
ru: Записать
tr: Kaydet
uk: Записати
vi: Ghi
zh_hans: 录制
zh_hant: 錄製

# settings.general.shortcuts.refreshCurrentContent.help
source: Click to record a new repository refresh shortcut
ar: انقر لتسجيل اختصار جديد لتحديث المستودع
de: Klicken Sie, um eine neue Tastenkombination zum Aktualisieren des Repositorys aufzuzeichnen
es: Haz clic para grabar un nuevo atajo de actualización de repositorio
fr: Cliquez pour enregistrer un nouveau raccourci d'actualisation de dépôt
id: Klik untuk merekam pintasan refresh repositori baru
it: Fai clic per registrare una nuova scorciatoia per aggiornare il repository
ja: クリックして新しいリポジトリ更新ショートカットを記録
ko: 클릭하여 새로운 저장소 새로고침 단축키를 기록합니다
nl: Klik om een nieuwe sneltoets voor het vernieuwen van de repository op te nemen
pl: Kliknij, aby nagrać nowy skrót odświeżania repozytorium
pt_br: Clique para gravar um novo atalho de atualização do repositório
ru: Нажмите, чтобы записать новое сочетание для обновления репозитория
tr: Yeni bir depo yenileme kısayolu kaydetmek için tıklayın
uk: Натисніть, щоб записати нову комбінацію для оновлення репозиторію
vi: Nhấp để ghi lại phím tắt làm mới kho lưu trữ mới
zh_hans: 点击录制新的仓库刷新快捷键
zh_hant: 點擊以錄製新的儲存庫重新整理快捷鍵

# settings.general.shortcuts.refreshCurrentContent.title
source: Refresh Repository List/Details
ar: تحديث قائمة/تفاصيل المستودع
de: Repository-Liste/Details aktualisieren
es: Actualizar lista/detalles del repositorio
fr: Actualiser la liste/détails du dépôt
id: Refresh Daftar/Detail Repositori
it: Aggiorna elenco/dettagli repository
ja: リポジトリリスト/詳細を更新
ko: 저장소 목록/세부정보 새로고침
nl: Repositorylijst/details vernieuwen
pl: Odśwież listę/szczegóły repozytorium
pt_br: Atualizar Lista/Detalhes do Repositório
ru: Обновить список/детали репозитория
tr: Depo Listesini/Detaylarını Yenile
uk: Оновити список/деталі репозиторію
vi: Làm mới Danh sách/Chi tiết Kho lưu trữ
zh_hans: 刷新仓库列表/详情
zh_hant: 重新整理儲存庫列表/詳細資訊

# settings.general.shortcuts.regularSearch.help
source: Click to record a new local search shortcut
ar: انقر لتسجيل اختصار بحث محلي جديد
de: Klicken Sie, um eine neue Tastenkombination für die lokale Suche aufzuzeichnen
es: Haz clic para grabar un nuevo atajo de búsqueda local
fr: Cliquez pour enregistrer un nouveau raccourci de recherche locale
id: Klik untuk merekam pintasan pencarian lokal baru
it: Fai clic per registrare una nuova scorciatoia per la ricerca locale
ja: クリックして新しいローカル検索ショートカットを記録
ko: 클릭하여 새로운 로컬 검색 단축키를 기록합니다
nl: Klik om een nieuwe sneltoets voor lokaal zoeken op te nemen
pl: Kliknij, aby nagrać nowy skrót wyszukiwania lokalnego
pt_br: Clique para gravar um novo atalho de busca local
ru: Нажмите, чтобы записать новое сочетание для локального поиска
tr: Yeni bir yerel arama kısayolu kaydetmek için tıklayın
uk: Натисніть, щоб записати нову комбінацію для локального пошуку
vi: Nhấp để ghi lại phím tắt tìm kiếm cục bộ mới
zh_hans: 点击录制新的常规搜索快捷键
zh_hant: 點擊以錄製新的本地搜尋快捷鍵

# settings.general.shortcuts.regularSearch.title
source: Local Search
ar: بحث محلي
de: Lokale Suche
es: Búsqueda local
fr: Recherche locale
id: Pencarian Lokal
it: Ricerca locale
ja: ローカル検索
ko: 로컬 검색
nl: Lokaal zoeken
pl: Wyszukiwanie lokalne
pt_br: Busca Local
ru: Локальный поиск
tr: Yerel Arama
uk: Локальний пошук
vi: Tìm kiếm Cục bộ
zh_hans: 常规搜索
zh_hant: 本地搜尋

# settings.general.shortcuts.restoreDefault
source: Restore Default
ar: استعادة الافتراضي
de: Standard wiederherstellen
es: Restaurar valores predeterminados
fr: Restaurer les valeurs par défaut
id: Kembalikan Default
it: Ripristina predefiniti
ja: デフォルトに戻す
ko: 기본값 복원
nl: Standaard herstellen
pl: Przywróć domyślne
pt_br: Restaurar Padrão
ru: Восстановить стандартные
tr: Varsayılana Dön
uk: Відновити стандартні
vi: Khôi phục Mặc định
zh_hans: 恢复默认
zh_hant: 恢復預設

# settings.general.shortcuts.search.help
source: Click to record a new global search shortcut
ar: انقر لتسجيل اختصار بحث عالمي جديد
de: Klicken Sie, um eine neue Tastenkombination für die globale Suche aufzuzeichnen
es: Haz clic para grabar un nuevo atajo de búsqueda global
fr: Cliquez pour enregistrer un nouveau raccourci de recherche globale
id: Klik untuk merekam pintasan pencarian global baru
it: Fai clic per registrare una nuova scorciatoia per la ricerca globale
ja: クリックして新しいグローバル検索ショートカットを記録
ko: 클릭하여 새로운 전역 검색 단축키를 기록합니다
nl: Klik om een nieuwe sneltoets voor globaal zoeken op te nemen
pl: Kliknij, aby nagrać nowy skrót wyszukiwania globalnego
pt_br: Clique para gravar um novo atalho de busca global
ru: Нажмите, чтобы записать новое сочетание для глобального поиска
tr: Yeni bir genel arama kısayolu kaydetmek için tıklayın
uk: Натисніть, щоб записати нову комбінацію для глобального пошуку
vi: Nhấp để ghi lại phím tắt tìm kiếm toàn cục mới
zh_hans: 点击录制新的全局搜索快捷键
zh_hant: 點擊以錄製新的全域搜尋快捷鍵

# settings.general.shortcuts.search.title
source: Global Search
ar: بحث عالمي
de: Globale Suche
es: Búsqueda global
fr: Recherche globale
id: Pencarian Global
it: Ricerca globale
ja: グローバル検索
ko: 전역 검색
nl: Globaal zoeken
pl: Wyszukiwanie globalne
pt_br: Busca Global
ru: Глобальный поиск
tr: Genel Arama
uk: Глобальний пошук
vi: Tìm kiếm Toàn cục
zh_hans: 全局搜索
zh_hant: 全域搜尋

# settings.general.shortcuts.selectedRepoAI.help
source: Click to record a new current repository AI shortcut
ar: انقر لتسجيل اختصار جديد للذكاء الاصطناعي للمستودع الحالي
de: Klicken Sie, um eine neue Tastenkombination für das aktuelle Repository-KI aufzuzeichnen
es: Haz clic para grabar un nuevo atajo de IA del repositorio actual
fr: Cliquez pour enregistrer un nouveau raccourci IA du dépôt actuel
id: Klik untuk merekam pintasan AI repositori saat ini baru
it: Fai clic per registrare una nuova scorciatoia AI per il repository corrente
ja: クリックして新しい現在のリポジトリAIショートカットを記録
ko: 클릭하여 새로운 현재 저장소 AI 단축키를 기록합니다
nl: Klik om een nieuwe sneltoets voor AI in de huidige repository op te nemen
pl: Kliknij, aby nagrać nowy skrót AI dla bieżącego repozytorium
pt_br: Clique para gravar um novo atalho de IA do repositório atual
ru: Нажмите, чтобы записать новое сочетание для ИИ текущего репозитория
tr: Yeni bir geçerli depo AI kısayolu kaydetmek için tıklayın
uk: Натисніть, щоб записати нову комбінацію для ШІ поточного репозиторію
vi: Nhấp để ghi lại phím tắt AI kho lưu trữ hiện tại mới
zh_hans: 点击录制新的当前仓库 AI 快捷键
zh_hant: 點擊以錄製新的目前儲存庫 AI 快捷鍵

# settings.general.shortcuts.selectedRepoAI.title
source: Current Repository AI
ar: الذكاء الاصطناعي للمستودع الحالي
de: Aktuelles Repository-KI
es: IA del repositorio actual
fr: IA du dépôt actuel
id: AI Repositori Saat Ini
it: AI repository corrente
ja: 現在のリポジトリAI
ko: 현재 저장소 AI
nl: AI huidige repository
pl: AI bieżącego repozytorium
pt_br: IA do Repositório Atual
ru: ИИ текущего репозитория
tr: Geçerli Depo AI
uk: ШІ поточного репозиторію
vi: AI Kho lưu trữ Hiện tại
zh_hans: 当前仓库 AI
zh_hant: 目前儲存庫 AI

# settings.general.title
source: General
ar: عام
de: Allgemein
fr: Général
id: Umum
it: Generali
ja: 一般
ko: 일반
nl: Algemeen
pl: Ogólne
pt_br: Geral
ru: Основные
tr: Genel
uk: Загальні
vi: Chung
zh_hans: 通用
zh_hant: 一般

# settings.integration.alfred.install
source: Get Workflow
ar: الحصول على Workflow
de: Workflow laden
es: Obtener Workflow
fr: Obtenir le workflow
id: Dapatkan Workflow
it: Ottieni Workflow
ja: Workflow を入手
ko: Workflow 받기
nl: Workflow ophalen
pl: Pobierz Workflow
pt_br: Obter Workflow
ru: Получить Workflow
tr: Workflow'u Al
uk: Отримати Workflow
vi: Tải Workflow
zh_hans: 获取 Workflow
zh_hant: 取得 Workflow

# settings.integration.alfred.subtitle
source: Search Starcat local repositories and GitHub from Alfred. Local results open in Starcat; other results open on GitHub. Requires Starcat Pro, MCP Service, and Starcat CLI.
ar: ابحث في مستودعات Starcat المحلية وGitHub من Alfred. تُفتح النتائج المحلية في Starcat والنتائج الأخرى على GitHub. يتطلب Starcat Pro وMCP Service وStarcat CLI.
de: Durchsuchen Sie lokale Starcat-Repositories und GitHub mit Alfred. Lokale Treffer werden in Starcat geöffnet, andere auf GitHub. Erfordert Starcat Pro, MCP Service und Starcat CLI.
es: Busca repositorios locales de Starcat y GitHub desde Alfred. Los resultados locales se abren en Starcat y los demás en GitHub. Requiere Starcat Pro, MCP Service y Starcat CLI.
fr: Recherchez les dépôts locaux Starcat et GitHub depuis Alfred. Les résultats locaux s’ouvrent dans Starcat, les autres sur GitHub. Nécessite Starcat Pro, MCP Service et Starcat CLI.
id: Cari repositori lokal Starcat dan GitHub dari Alfred. Hasil lokal dibuka di Starcat, hasil lain di GitHub. Memerlukan Starcat Pro, MCP Service, dan Starcat CLI.
it: Cerca repository locali di Starcat e GitHub da Alfred. I risultati locali si aprono in Starcat, gli altri su GitHub. Richiede Starcat Pro, MCP Service e Starcat CLI.
ja: Alfred から Starcat のローカルリポジトリと GitHub を検索します。ローカル結果は Starcat、その他は GitHub で開きます。Starcat Pro、MCP Service、Starcat CLI が必要です。
ko: Alfred에서 Starcat 로컬 저장소와 GitHub를 검색합니다. 로컬 결과는 Starcat에서, 나머지는 GitHub에서 엽니다. Starcat Pro, MCP Service 및 Starcat CLI가 필요합니다.
nl: Doorzoek lokale Starcat-repository's en GitHub vanuit Alfred. Lokale resultaten openen in Starcat, andere op GitHub. Vereist Starcat Pro, MCP Service en Starcat CLI.
pl: Przeszukuj lokalne repozytoria Starcat i GitHub z Alfreda. Lokalne wyniki otwierają się w Starcat, pozostałe w GitHub. Wymaga Starcat Pro, MCP Service i Starcat CLI.
pt_br: Pesquise repositórios locais do Starcat e o GitHub pelo Alfred. Resultados locais abrem no Starcat; os demais, no GitHub. Requer Starcat Pro, MCP Service e Starcat CLI.
ru: Ищите локальные репозитории Starcat и GitHub через Alfred. Локальные результаты открываются в Starcat, остальные — на GitHub. Требуются Starcat Pro, MCP Service и Starcat CLI.
tr: Alfred üzerinden Starcat yerel depolarını ve GitHub'ı arayın. Yerel sonuçlar Starcat'te, diğerleri GitHub'da açılır. Starcat Pro, MCP Service ve Starcat CLI gerekir.
uk: Шукайте локальні репозиторії Starcat і GitHub через Alfred. Локальні результати відкриваються у Starcat, інші — на GitHub. Потрібні Starcat Pro, MCP Service і Starcat CLI.
vi: Tìm kho lưu trữ cục bộ của Starcat và GitHub từ Alfred. Kết quả cục bộ mở trong Starcat, các kết quả khác mở trên GitHub. Yêu cầu Starcat Pro, MCP Service và Starcat CLI.
zh_hans: 在 Alfred 中搜索 Starcat 本地仓库和 GitHub。本地结果在 Starcat 中打开，其余结果在 GitHub 中打开。需要 Starcat Pro、MCP Service 和 Starcat CLI。
zh_hant: 在 Alfred 中搜尋 Starcat 本機儲存庫和 GitHub。本機結果在 Starcat 中開啟，其餘結果在 GitHub 中開啟。需要 Starcat Pro、MCP Service 和 Starcat CLI。

# settings.integration.browserPlugin.apiKey
source: API Key
ar: مفتاح API
de: API-Schlüssel
es: Clave de API
fr: Clé API
id: Kunci API
it: Chiave API
ja: APIキー
ko: API 키
nl: API-sleutel
pl: Klucz API
pt_br: Chave de API
ru: API-ключ
tr: API Anahtarı
uk: Ключ API
vi: Khóa API
zh_hant: API 金鑰

# settings.integration.browserPlugin.apiKey.description
source: Use the Local API Key managed at the top of Integrations.
ar: استخدم مفتاح API المحلي المُدار في أعلى قسم التكاملات.
de: Verwenden Sie den lokalen API-Schlüssel, der oben unter Integrationen verwaltet wird.
es: Usa la clave de API local gestionada en la parte superior de Integraciones.
fr: Utilisez la clé API locale gérée en haut des intégrations.
id: Gunakan Kunci API Lokal yang dikelola di bagian atas Integrasi.
it: Usa la chiave API locale gestita all'inizio di Integrazioni.
ja: 統合の上部で管理されているローカルAPIキーを使用します。
ko: 통합 설정 상단에서 관리되는 로컬 API 키를 사용하세요.
nl: Gebruik de lokale API-sleutel die bovenaan bij Integraties wordt beheerd.
pl: Użyj lokalnego klucza API zarządzanego na górze sekcji Integracje.
pt_br: Use a Chave de API Local gerenciada no topo de Integrações.
ru: Используйте локальный API-ключ, управляемый в верхней части раздела «Интеграции».
tr: Entegrasyonlar bölümünün üst kısmında yönetilen Yerel API Anahtarını kullanın.
uk: Використовуйте локальний ключ API, керований у верхній частині розділу «Інтеграції».
vi: Sử dụng Khóa API Cục bộ được quản lý ở đầu phần Tích hợp.
zh_hans: 使用集成页顶部统一管理的本地 API Key。
zh_hant: 使用整合頁面頂端統一管理的本地 API 金鑰。
